app/mailers/guest_mailer.rb

  def guestlist_email()
     Guestlist.all.each { |guestlist| mail(to: guestlist.email) }
---
SELECT "guestlists".* FROM "guestlists"