app/views/todo_lists/show.html.erb

SELECT "todo_items".* FROM "todo_items" WHERE "todo_items"."todo_list_id" = ?  [["todo_list_id", 1]]
SELECT COUNT(*) AS count_all, strftime('%Y-%m-%d 00:00:00 UTC', "todo_items"."created_at") AS strftime_y_m_d_00_00_00_utc_todo_items_created_at FROM "todo_items" WHERE ("todo_items"."created_at" IS NOT NULL) GROUP BY strftime('%Y-%m-%d 00:00:00 UTC', "todo_items"."created_at")
---
 <h1>Number of Tasks created</h1>
 <%= line_chart TodoItem.group_by_day(:created_at).count %>