app/views/events/index.html.erb

SELECT "events".* FROM "events"
SELECT COUNT(*) AS count_all, strftime('%Y-%m-%d 00:00:00 UTC', "events"."created_at") AS strftime_y_m_d_00_00_00_utc_events_created_at FROM "events" WHERE ("events"."created_at" IS NOT NULL) GROUP BY strftime('%Y-%m-%d 00:00:00 UTC', "events"."created_at")
---
<h1>Number of events created</h1>
<%= line_chart Event.group_by_day(:created_at).count %>