app/views/guestlists/index.html.erb

<h1>Number of responses by guests</h1>
<%= pie_chart Guestlist.group(:response).count %>
---
SELECT COUNT(*) AS count_all, "guestlists"."response" AS guestlists_response FROM "guestlists" GROUP BY "guestlists"."response"