app/controllers/events_controller.rb

SELECT  "events".* FROM "events" WHERE "events"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def landing_page
    @event = Event.find(params[:event_id])

INSERT INTO "events" ("name", "description", "created_at", "updated_at", "date_of_event", "location", "rsvp_cut_off") VALUES (?, ?, ?, ?, ?, ?, ?)
---
  def create
    @event = Event.new(event_params)


    respond_to do |format|
      if @event.save

UPDATE "events" SET "location" = ?, "date_of_event" = ?, "updated_at" = ? WHERE "events"."id" = ?  [["location", "Century City"], ["date_of_event", "2019-06-06 16:00:00"], ["updated_at", "2019-04-26 07:22:27.295108"], ["id", 3]]
---
  def update
    respond_to do |format|
      if @event.update(event_params)