app/controllers/guests_controller.rb

  def index
    @guests = @event.guests
    if params[:search]
      @search_term = params[:search]
      @guests = @event.guests.search_by(@search_term)
      # @guest = @event.guests.find(params[:search])
    end
    if params[:search] && @guests.count == 1
        @guest = @event.guests.find(params[:search])
---
SELECT COUNT(*) FROM "guests" WHERE "guests"."event_id" = ? AND ((id) LIKE '%1%')  [["event_id", 1]]
SELECT  "guests".* FROM "guests" WHERE "guests"."event_id" = ? AND "guests"."id" = ? LIMIT ?  [["event_id", 1], ["id", 1], ["LIMIT", 1]]

  def show
    @guest = @event.guests.find(params[:id])
---
SELECT  "guests".* FROM "guests" WHERE "guests"."event_id" = ? AND "guests"."id" = ? LIMIT ?  [["event_id", 1], ["id", 1], ["LIMIT", 1]]

  def create
    # @event = Event.find(params[:event_id])
    @guest = @event.guests.create(guest_params)
    respond_to do |format|
      if @guest.save
        format.html { redirect_to @event, notice: 'Guest was successfully added.' }
        GuestMailer.with(guest: @guest, event: @event).guest_email.deliver_now
---
INSERT INTO "guests" ("name", "email", "created_at", "updated_at", "event_id") VALUES (?, ?, ?, ?, ?)  [["name", "Ryan Neill"], ["email", "ryan.neill11@gmail.com"], ["created_at", "2019-10-03 09:00:04.304557"], ["updated_at", "2019-10-03 09:00:04.304557"], ["event_id", 1]]
INSERT INTO "guests" ("response", "created_at", "updated_at", "event_id") VALUES (?, ?, ?, ?)  [["response", "yes"], ["created_at", "2019-08-13 18:12:45.092658"], ["updated_at", "2019-08-13 18:12:45.092658"], ["event_id", 1]]
SELECT  "guests".* FROM "guests" WHERE "guests"."event_id" = ? AND "guests"."id" = ? LIMIT ?  [["event_id", 1], ["id", 1], ["LIMIT", 1]]

  def update
    @event = Event.find(params[:event_id])
    @guest = @event.guests.create(guest_params)
---
SELECT  "events".* FROM "events" WHERE "events"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "guests" ("response", "created_at", "updated_at", "event_id") VALUES (?, ?, ?, ?)  [["response", "yes"], ["created_at", "2019-10-02 12:33:27.408807"], ["updated_at", "2019-10-02 12:33:27.408807"], ["event_id", 1]]

  def destroy
    @guest.destroy
---
DELETE FROM "guests" WHERE "guests"."id" = ?  [["id", 13]]

   def set_event
     @event = Event.find(params[:event_id])
---
SELECT  "events".* FROM "events" WHERE "events"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

    def set_guest
      @guest = @event.guests.find(params[:id])
---
SELECT  "guests".* FROM "guests" WHERE "guests"."event_id" = ? AND "guests"."id" = ? LIMIT ?  [["event_id", 1], ["id", 1], ["LIMIT", 1]]