app/controllers/guestlists_controller.rb

  def index
  @guestlists = Guestlist.all
  @guestlists = Guestlist.order(:name)
---
SELECT "guestlists".* FROM "guestlists" ORDER BY "guestlists"."name" ASC

def import
  Guestlist.import(params[:file])
  # GuestMailer.with(guestlist: @guestlist).guestlist_email.deliver_now
  Guestlist.all.each do |guestlist|
---
SELECT "guestlists".* FROM "guestlists"

  def create
    @guestlist = Guestlist.new(guestlist_params)

    respond_to do |format|
      if @guestlist.save
---
INSERT INTO "guestlists" ("name", "email", "response", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "Ryan Neill"], ["email", "ryan.neill11@gmail.com"], ["response", ""], ["created_at", "2019-08-09 08:39:56.085555"], ["updated_at", "2019-08-09 08:39:56.085555"]]

  def update
    respond_to do |format|
      if @guestlist.update(guestlist_params)
---
UPDATE "guestlists" SET "response" = ?, "updated_at" = ? WHERE "guestlists"."id" = ?  [["response", "yes"], ["updated_at", "2019-10-01 10:23:01.471071"], ["id", 2]]

  def destroy
    @guestlist.destroy
---
DELETE FROM "guestlists" WHERE "guestlists"."id" = ?  [["id", 1]]

    def set_guestlist
      @guestlist = Guestlist.find(params[:id])
---
SELECT  "guestlists".* FROM "guestlists" WHERE "guestlists"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]