app/controllers/locations_controller.rb

  def create
    @location = Location.new(location_params)

    respond_to do |format|
      if @location.save
---
INSERT INTO "locations" ("name", "latitude", "longitude", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", ""], ["latitude", 51.5], ["longitude", 0.0], ["created_at", "2019-04-19 13:00:40.328300"], ["updated_at", "2019-04-19 13:00:40.328300"]]

  def update
    respond_to do |format|
      if @location.update(location_params)
---
UPDATE "locations" SET "latitude" = ?, "longitude" = ?, "updated_at" = ? WHERE "locations"."id" = ?  [["latitude", 51.5], ["longitude", 0.0], ["updated_at", "2019-04-19 13:00:01.237842"], ["id", 2]]

  def destroy
    @location.destroy
---
DELETE FROM "locations" WHERE "locations"."id" = ?  [["id", 11]]