app/controllers/todo_items_controller.rb

INSERT INTO "todo_items" ("content", "todo_list_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["content", "Find frineds"], ["todo_list_id", 1], ["created_at", "2019-08-14 06:42:02.054357"], ["updated_at", "2019-08-14 06:42:02.054357"]]
---
def create
 @todo_item = @todo_list.todo_items.create(todo_item_params)

SELECT  "todo_items".* FROM "todo_items" WHERE "todo_items"."todo_list_id" = ? AND "todo_items"."id" = ? LIMIT ?  [["todo_list_id", 2], ["id", 3], ["LIMIT", 1]]
DELETE FROM "todo_items" WHERE "todo_items"."id" = ?  [["id", 3]]
---
def destroy
 @todo_item = @todo_list.todo_items.find(params[:id])
 if @todo_item.destroy