app/models/guestlist.rb

INSERT INTO "guestlists" ("id", "name", "email", "response", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["id", 3], ["name", "Ryan Neill"], ["email", "ryan.neill11@gmail.com"], ["response", "no"], ["created_at", "2019-10-01 14:43:31.133312"], ["updated_at", "2019-10-01 14:43:31.133312"]]
UPDATE "guestlists" SET "name" = ?, "email" = ?, "response" = ?, "updated_at" = ? WHERE "guestlists"."id" = ?  [["name", "ryan"], ["email", "nllrya002@myuct.ac.za"], ["response", ""], ["updated_at", "2019-10-02 12:12:30.474288"], ["id", 3]]
---
def self.import(file)
  spreadsheet = Roo::Spreadsheet.open(file.path)
  header = spreadsheet.row(1)
  (2..spreadsheet.last_row).each do |i|
    row = Hash[[header, spreadsheet.row(i)].transpose]
    guestlist = find_by(id: row["id"]) || new
    guestlist.attributes = row.to_hash
    guestlist.save!